Давайте поговорим по поводу Арифметики :)
x + y // Плюс :)
+ y // Унарный минус (Число положительное)
x - y // Минус
- x // Унарный минус (Число отрицательное)
x * y // Умножение 
x / y // Деление
x % y // Остаток от деления (Для целых чисел ~ INT)
Операторы сравнения : )
x == y // Равно
x != y // Не равно :(
x<y  // Меньше
	x>y  // Больше 
	x <= y // Меньше или равно
	x >= y // Больше или равно
	Не забывайте про логические операторы!
	x & y // Побитовое и (бинарная операция, действие которой эквивалентно применению логического «И» к каждой паре битов, которые стоят на одинаковых позициях в двоичных представлениях операндов)
	x | y // Побитовая операция или
	x ^ y // Побитовое исключающее или
	x && y // Логическое и
	x || y // Логическое или
	!x // Логическое не (Отрицание)

	void random_function() // Функция не возвращающая значение
{
	double d = 2.2;
	int i = 7;
	d = d + i; // Присваивание суммы переменной d
	i = d * i // Присваивание произведения переменной i, c
}
x += y // x = x + y
++x // Инкремент: x = x + 1
x -= y // x = x - y;
--x // Декремент x = x - 1;
x*=y // x = x * y
x/=y // x = x / y
x%=y // x = x % y
Конец :) 
